{
    "GAME_NOT_STARTED": "La partie n'a pas commencée !",
    "CMD_HELP_TEXT": "Liste des commandes disponible: !aide: affiche la liste des commandes",
    "CMD_HELP_TEXT_PASS": " !passer: Vous permet de passer votre tour ",
    "CMD_HELP_TEXT_PLACE": "!placer: place une ou plusieurs lettres selon la syntaxe suivante:!placer <ligne><colonne>(h|v) <mot>",
    "CMD_HELP_TEXT_EXCHANGE": "!échanger: échange des lettres du chevalet selon la syntaxe suivant:!échanger <lettre>...",
    "CMD_HELP_TEXT_DEBUG": "!debug: affiche des options et informations de débogage",
    "CMD_HELP_TEXT_RESERVE": "!reserve: affiche toutes les lettres et leur quantité restante dans la reserve",
    "INVALID_ENTRY": "Commande invalide",
    "RESERVE_CMD": "Voici les lettres dans la reserve:",
    "PLACE_CMD": "Vous avez placé vos lettres",
    "EXCHANGE_PLAYER_CMD": "Vous avez échangé vos lettres",
    "PASS_CMD": "Vous avez passé votre tour",
    "DEBUG_CMD_ON": "affichages de débogage activés",
    "DEBUG_CMD_OFF": "affichages de débogage désactivés",
    "DEBUG_NOT_ACTIVATED": "Commande impossible. Debug n'est pas activé",
    "NOT_YOUR_TURN": "Ce n'est pas votre tour de jouer !",
    "NOT_ENOUGH_LETTERS": "Il ne reste plus assez de lettres dans la réserve",
    "GAME_IS_OVER": "La partie est terminée vous ne pouvez plus rentrer de commandes",
    "WINNER_MSG_PT1": "Bravo ",
    "WINNER_MSG_PT2": " a gagne la partie avec un score de: ",
    "DRAW_MSG": "La partie a fini a égalité, bravo !",
    "GAME_NOT_UNDERSTOOD": "Vous jouer tellement bien que le système ne comprend pas ce qu'il se passe donc personne n'a gagne (ou tout le monde on ne sait pas) !",
    "INVALID_LENGTH": " La taille maximale de 512 caractère a ete dépassée",
    "UNABLE_TO_PROCESS_COMMAND": "Commande impossible ",
    "WORD_DOESNT_EXIST": "Le mot n'existe pas.",
    "END_GAME_DISPLAY_MSG": "La partie est terminée.",
    "INVALID_ARGUMENTS_PLACER": ": la commande !placer n'as pas d'arguments ou bien des arguments de position invalides",
    "INVALID_ARGUMENTS_EXCHANGE": " : La commande n'a pas d'arguments ou trop d'arguments!",
    "LETTER_NOT_IN_ALPHABET": " : la lettre a échanger n'est pas dans l'alphabet!",
    "LETTER_NOT_ON_STAND": " : la lettre a échanger n'est pas sur ton chevalet !",
    "INVALID_WORD": " : caractères du mot incorrects!",
    "WORD_DONT_FIT_BOARD": ": le mot ne rentre pas dans le plateau!",
    "LETTERS_MUST_TOUCH_OTHERS": " : les lettres que vous avez placées doivent toucher celles déjà sur le plateau!",
    "FIRST_LETTER_NOT_IN_H8": " : votre premier mot doit commencer dans la case h8!",
    "TMP_LETTERS_MUST_TOUCH": " : vos lettres deposées doivent se toucher!",
    "REPLACEMENT_BY_BOT": "Un bot a maintenant remplacé votre adversaire.",
    "REPLACEMENT_BY_PLAYER": " a remplacé le joueur virtuel: ",
    "PLAYER_TRIED_A_WORD": " a placé un mot non valide, son tour passe !",
    "JUMP_NEXT_ENNEMY_TURN": "Cette carte permet de faire sauter le tour du prochain joueur.",
    "TRANFORM_EMPTY_TILE": "Cette carte permet de transformer une tuile vide en case bonus de couleur aléatoire.",
    "REDUCE_ENNEMY_TIME": "Cette carte permet de réduire de moitié le temps de réflexion des prochains joueurs pendant 1 tour.",
    "EXCHANGE_LETTER_JOKER": "Cette carte permet d'échanger une lettre de votre chevalet contre une lettre de votre choix du sac de lettres.",
    "EXCHANGE_STAND": "Cette carte permet d'échanger votre chevalet avec celui d'un de vos adversaires.",
    "REMOVE_POINTS_FROM_MAX": "Cette carte permet de retirer des points à l'adversaire qui en a le plus et les redistribue à tous les autres joueurs.",
    "ADD_1_MIN": "Cette carte permet d'ajouter 1 minute à votre temps de reglexion.",
    "REMOVE_1_POWER_CARD_FOR_EVERYONE": "Cette carte permet de retirer une carte pouvoir à tous les joueurs ennemis.",
    "GAME_FINISHED": "Fin de la partie !",
    "INVALID_COMMAND": "Commande Invalide",
    "THE_PLAYER": "Le joueur ",
    "NO_SOLUTION": "Pas de solution trouvée pour cette plage de pointage.",
    "PASS": "!passer",
    "PLACE": "!placer",
    "POWER1": " a utilisé une carte de pouvoir pour passer le tour du prochain joueur !",
    "POWER2": " a utilisé une carte de pouvoir pour tranformer la case ligne ",
    "COLUMN": " colonne ",
    "IN": " en ",
    "BONUS": " bonus !",
    "POWER3": " a utilisé une carte de pouvoir pour diviser par deux le temps de tous les joueurs pendant 1 tour !",
    "POWER4": " a utilisé une carte de pouvoir pour échanger une de ses lettres avec une lettre de la réserve !",
    "POWER5": " a utilisé une carte de pouvoir pour échanger son stand avec ",
    "POWER6": " a utilisé une carte de pouvoir pour retirer des points au joueur avec le plus de points !",
    "HAS_LOST": " a donc perdu ",
    "SCORE": " points.",
    "POWER7": "Ces points ont été répartis entre tout les joueurs.",
    "POWER8": " a utilisé une carte de pouvoir pour rajouter 1 minutes à son temps de reflexion !",
    "POWER9": "Le temps est divisé par deux due à l'utilisation d'une carte de pouvoir !",
    "HAS_GIVEN_UP": " a abandonné la partie.",
    "HAS_USED": " a utilisé une carte pouvoir et le tour de ",
    "HAS_BEEN_JUMPED": " a été sauté.",
    "ASK_ENTRANCE_SENT": "Votre demande pour rentrer dans la salle a été envoyée !"
}
